test_new/Lagrangian/bubbles/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1;
        startFace       99;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1;
        startFace       100;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          400;
        startFace       101;
    }
)

// ************************************************************************* //
