test_new/Lagrangian/bubbles/0/Lagrangian/bubbles/m
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       LagrangianScalarField;
    location    "0/Lagrangian/bubbles";
    object      m;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 0();

boundaryField
{
    bottom
    {
        type            calculated;
    }
    top
    {
        type            calculated;
    }
    defaultFaces
    {
        type            empty;
    }
}

sources
{
    injection
    {
        type            mass;
    }
}


// ************************************************************************* //
